/*
# 【深基3.例9】月份天数

## 题目描述

输入年份和月份，输出这一年的这一月有多少天。需要考虑闰年。

## 输入格式

输入两个正整数，分别表示年份 $y$ 和月数 $m$，以空格隔开。

## 输出格式

输出一行一个正整数，表示这个月有多少天。

## 样例 #1

### 样例输入 #1

```
1926 8
```

### 样例输出 #1

```
31
```

## 样例 #2

### 样例输入 #2

```
2000 2
```

### 样例输出 #2

```
29
```

## 提示

数据保证 $1583 \leq y \leq 2020$，$1 \leq m \leq 12$。
*/

#include <iostream>
using namespace std;
int main()
{
    int y, m;
    cin >> y >> m;
    if (m == 2)
    {
        if (y % 400 == 0 || (y % 4 == 0 && y % 100 != 0))
        {
            cout << 29 << endl;
        }
        else
        {
            cout << 28 << endl;
        }
    }
    else if (m == 1 || m == 3 || m == 5 || m == 7 || m == 8 || m == 10 || m == 12)
    {
        cout << 31 << endl;
    }
    else
    {
        cout << 30 << endl;
    }
    return 0;
}